app/views/ads/new.html.erb

        <option></option>
        <% Subcat.all.each do |subcat| %>
---
SELECT "subcats".* FROM "subcats"