app/views/users/posted_ads.html.erb

      <% @user.posted_ads.each do |ad|  %>
          <% options = {ad_id: ad.id, status: 'UNKNOWN', title: ad.title,
           region: ad.region, category: Subcat.find(ad.subcat_id).title,
            posted_date: ad.created_at, responses: ad.responses_count} %>
---
SELECT "subcats".* FROM "subcats" WHERE "subcats"."id" = $1 LIMIT 1  [["id", 3]]