app/controllers/ads_controller.rb

SELECT "subcats".* FROM "subcats" WHERE "subcats"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def index
    @subcat = Subcat.includes(:ads).find(params[:subcat_id])

SELECT "subcats".* FROM "subcats" WHERE "subcats"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @ad = Ad.includes(:subcat).includes(:pictures).find(params[:id])