app/controllers/responses_controller.rb

  def create
    ad = Ad.find(params[:ad_id])
    @response = ad.responses.new(
    response_params.merge({
      respondent_id: current_user.id,
      respondable_id: params[:ad_id],
      respondable_type: 'Ad'
      }))

    if @response.save
---
INSERT INTO "responses" ("ad_id", "body", "created_at", "respondable_id", "respondable_type", "respondent_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"