app/controllers/subcats_controller.rb

SELECT "categories".* FROM "categories"
SELECT "subcats".* FROM "subcats" WHERE "subcats"."category_id" IN (1, 2, 3)
---
  def index
    @categories = Category.include(:subcats).all