app/controllers/users_controller.rb

  def posted_ads
    @user = User.includes(:posted_ads).find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @user = User.find(params[:id])
    if(require_current_user_matches!(@user) || require_admin!)
      @user.destroy!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]

  def update
    @user = User.find(params[:id])
    if(require_current_user_matches!(@user))
      if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "users" SET "password_digest" = $1, "username" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["password_digest", "$2a$10$mLBChk/9oyIMcLQdqUM93.jMzWPuH2PMVYpJG1JLWH5cL.uQk1zge"], ["username", "John"], ["updated_at", Wed, 23 Apr 2014 20:38:42 UTC +00:00]]